-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Sep 14, 2025 at 07:53 AM
-- Server version: 10.4.32-MariaDB
-- PHP Version: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `saint_student_data`
--

-- --------------------------------------------------------

--
-- Table structure for table `tb_ursername`
--

CREATE TABLE `tb_ursername` (
  `id` int(11) NOT NULL,
  `Number` int(3) NOT NULL,
  `Code` varchar(10) NOT NULL,
  `pname` varchar(10) NOT NULL,
  `name` varchar(50) NOT NULL,
  `last_name` varchar(50) NOT NULL,
  `classroom` varchar(5) NOT NULL,
  `Email` varchar(100) NOT NULL,
  `password` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `tb_ursername`
--

INSERT INTO `tb_ursername` (`id`, `Number`, `Code`, `pname`, `name`, `last_name`, `classroom`, `Email`, `password`) VALUES
(77, 0, 'Code', 'pname', 'name', 'last_name', 'class', 'Email', 'password'),
(78, 1, '40338', 'ด.ช.', 'จารุวิทย์', 'ชิตแก้ว', '107', '40338@bpk.ac.th', '123'),
(79, 2, '40339', 'ด.ช.', 'ณภัทร', 'บุณยลักษิตานนท์', '107', '40339@bpk.ac.th', '123'),
(80, 3, '40340', 'ด.ช.', 'ณัชพน', 'กมลสุตโกศล', '107', '40340@bpk.ac.th', '123'),
(81, 4, '40341', 'ด.ช.', 'ณัฐวัชร์', 'ยอดรัก', '107', '40341@bpk.ac.th', '123'),
(82, 5, '40342', 'ด.ช.', 'ดอน', 'ดอนละไพร', '107', '40342@bpk.ac.th', '123'),
(83, 6, '40343', 'ด.ช.', 'ธนราชย์', 'ภูรีวิลาส', '107', '40343@bpk.ac.th', '123'),
(84, 7, '40344', 'ด.ช.', 'ธีรภัทร', 'หิรัญญการ', '107', '40344@bpk.ac.th', '123'),
(85, 8, '40345', 'ด.ช.', 'ป้องปริชญ์', 'อุ่นเสรี', '107', '40345@bpk.ac.th', '123'),
(86, 9, '40346', 'ด.ช.', 'พงศกร', 'ธรรมสละ', '107', '40346@bpk.ac.th', '123'),
(87, 10, '40347', 'ด.ช.', 'พรหมภัสสร์', 'จาดคล้าย', '107', '40347@bpk.ac.th', '123'),
(88, 11, '40348', 'ด.ช.', 'ภัทรนันท์', 'ปัญจรัตน์', '107', '40348@bpk.ac.th', '123'),
(89, 12, '40349', 'ด.ช.', 'สิทธิโชค', 'โชยะสิทธิ์', '107', '40349@bpk.ac.th', '123'),
(90, 13, '40350', 'ด.ช.', 'อธิภัทร', 'ภูทะวงศ์', '107', '40350@bpk.ac.th', '123'),
(91, 14, '39988', 'ด.ญ.', 'วิชญาดา', 'มั่นคง', '107', '39988@bpk.ac.th', '123'),
(92, 15, '39989', 'ด.ญ.', 'วิชญาพร', 'แก้วพวง', '107', '39989@bpk.ac.th', '123'),
(93, 16, '40056', 'ด.ญ.', 'โศภิตา', 'รอดน้อย', '107', '40056@bpk.ac.th', '123'),
(94, 17, '40058', 'ด.ญ.', 'สุพิชชา', 'สุระเสียง', '107', '40058@bpk.ac.th', '123'),
(95, 18, '40077', 'ด.ญ.', 'อติกานต์', 'สุบรรณรัตน์', '107', '40077@bpk.ac.th', '123'),
(96, 19, '40087', 'ด.ญ.', 'อัยลฎา', 'ขาวปลื้ม', '107', '40087@bpk.ac.th', '123'),
(97, 20, '40351', 'ด.ญ.', 'กัญญาณัฐ', 'มีแก้ว', '107', '40351@bpk.ac.th', '123'),
(98, 21, '40352', 'ด.ญ.', 'กันยกร', 'ถิรมนธันยา', '107', '40352@bpk.ac.th', '123'),
(99, 22, '40353', 'ด.ญ.', 'จิรัชญา', 'หาญประทานพร', '107', '40353@bpk.ac.th', '123'),
(100, 23, '40354', 'ด.ญ.', 'ฉัตรพร', 'เข่งพิมพ์', '107', '40354@bpk.ac.th', '123'),
(101, 24, '40355', 'ด.ญ.', 'ชนัญชิดา', 'ชูช่วย', '107', '40355@bpk.ac.th', '123'),
(102, 25, '40356', 'ด.ญ.', 'ชวัลนุช', 'สุมงคลทวีป', '107', '40356@bpk.ac.th', '123'),
(103, 26, '40357', 'ด.ญ.', 'ณิชนันทน์', 'เพ็งจันทร์ดี', '107', '40357@bpk.ac.th', '123'),
(104, 27, '40358', 'ด.ญ.', 'ณิชาภา', 'พงษ์เกษมวิวัฒน์', '107', '40358@bpk.ac.th', '123'),
(105, 28, '40359', 'ด.ญ.', 'ธัญชนก', 'วิมลจินดา', '107', '40359@bpk.ac.th', '123'),
(106, 29, '40360', 'ด.ญ.', 'นิธิศา', 'วีระวัฒนมาศ', '107', '40360@bpk.ac.th', '123'),
(107, 30, '40361', 'ด.ญ.', 'ปาณิสรา', 'นิยมสุข', '107', '40361@bpk.ac.th', '123'),
(108, 31, '40362', 'ด.ญ.', 'ปาณิสรา', 'เรืองโรจน์', '107', '40362@bpk.ac.th', '123'),
(109, 32, '40363', 'ด.ญ.', 'พริภัคส์', 'วุฒิกุญปภา', '107', '40363@bpk.ac.th', '123'),
(110, 33, '40364', 'ด.ญ.', 'พิทยาภรณ์', 'วิภาภรณ์พรรณ', '107', '40364@bpk.ac.th', '123'),
(111, 34, '40366', 'ด.ญ.', 'ภัคพิชชา', 'หวังโซ๊ะ', '107', '40366@bpk.ac.th', '123'),
(112, 35, '40367', 'ด.ญ.', 'ภูษิตา', 'ม่วงจันทร์', '107', '40367@bpk.ac.th', '123'),
(113, 36, '40368', 'ด.ญ.', 'มนัญชญา', 'จันทร์อ่อน', '107', '40368@bpk.ac.th', '123'),
(114, 37, '40369', 'ด.ญ.', 'เมตยา', 'สุรรุจิโรจน์', '107', '40369@bpk.ac.th', '123'),
(115, 38, '40370', 'ด.ญ.', 'รักษยา', 'อินทร์นก', '107', '40370@bpk.ac.th', '123'),
(116, 39, '40371', 'ด.ญ.', 'ลภัสร', 'ช่างประดับ', '107', '40371@bpk.ac.th', '123'),
(117, 40, '39721', 'ด.ช.', 'กลวัชร์', 'ใจเที่ยง', '108', '39721@bpk.ac.th', '123'),
(118, 41, '39722', 'ด.ช.', 'กันตินันท์', 'แสงศรีจันทร์', '108', '39722@bpk.ac.th', '123'),
(119, 42, '39723', 'ด.ช.', 'กิตติศักดิ์', 'อนุชิตสกุลวงศ์', '108', '39723@bpk.ac.th', '123'),
(120, 43, '39724', 'ด.ช.', 'ครุภูมิ', 'จำนงค์ธรรม', '108', '39724@bpk.ac.th', '123'),
(121, 44, '39725', 'ด.ช.', 'ชานุ', 'องคะลอย', '108', '39725@bpk.ac.th', '123'),
(122, 45, '39726', 'ด.ช.', 'ชินาธิป', 'ชาวบ้านกร่าง', '108', '39726@bpk.ac.th', '123'),
(123, 46, '39727', 'ด.ช.', 'ณัฐฑานนท์', 'ถูกหมาย', '108', '39727@bpk.ac.th', '123'),
(124, 47, '39728', 'ด.ช.', 'นราวิชญ์', 'สุภาวิตาชน', '108', '39728@bpk.ac.th', '123'),
(125, 48, '39729', 'ด.ช.', 'สรณ์ศีล', 'จงพิทักษ์ศีล', '108', '39729@bpk.ac.th', '123'),
(126, 49, '39730', 'ด.ช.', 'ปภังกร', 'หาดคำ', '108', '39730@bpk.ac.th', '123'),
(127, 50, '39731', 'ด.ช.', 'ปภังกร', 'ไชยเนตร์', '108', '39731@bpk.ac.th', '123'),
(128, 51, '39732', 'ด.ช.', 'ปรัชญา', 'ใจซื่อ', '108', '39732@bpk.ac.th', '123'),
(129, 52, '39733', 'ด.ช.', 'สุรวุธ', 'อาดัมเจริญ', '108', '39733@bpk.ac.th', '123'),
(130, 53, '39734', 'ด.ช.', 'ปวริศ', 'บุตรตัน', '108', '39734@bpk.ac.th', '123'),
(131, 54, '39735', 'ด.ช.', 'พงศ์ศักดิ์', 'เชตฐราช', '108', '39735@bpk.ac.th', '123'),
(132, 55, '39736', 'ด.ช.', 'ฤทธิโรจน์', 'ทองแท่ง', '108', '39736@bpk.ac.th', '123'),
(133, 56, '39737', 'ด.ช.', 'อิทธิบาจ', 'แสนสุข', '108', '39737@bpk.ac.th', '123'),
(134, 57, '39741', 'ด.ช.', 'น่านเจ้า', 'แก้วอยู่', '108', '39741@bpk.ac.th', '123'),
(135, 58, '39748', 'ด.ช.', 'สรรเพชญ', 'มิีสุธา', '108', '39748@bpk.ac.th', '123'),
(136, 59, '39738', 'ด.ญ.', 'ยศสิณี', 'วิชัย', '108', '39738@bpk.ac.th', '123'),
(137, 60, '39739', 'ด.ญ.', 'ปภาดา', 'นุชประเสริฐ', '108', '39739@bpk.ac.th', '123'),
(138, 61, '39740', 'ด.ญ.', 'กรศศิร์', 'จันทน์คราญ', '108', '39740@bpk.ac.th', '123'),
(139, 62, '39742', 'ด.ญ.', 'ชญาดา', 'วงษ์ครุฑ', '108', '39742@bpk.ac.th', '123'),
(140, 63, '39743', 'ด.ญ.', 'ชัญญ์ชนพร', 'ศรีพลมาตย์', '108', '39743@bpk.ac.th', '123'),
(141, 64, '39744', 'ด.ญ.', 'ฐิติชญาณ์', 'ทรัพย์สมบูรณ์', '108', '39744@bpk.ac.th', '123'),
(142, 65, '39745', 'ด.ญ.', 'ณัฐนิชา', 'น้อยประสิทธิ์', '108', '39745@bpk.ac.th', '123'),
(143, 66, '39746', 'ด.ญ.', 'ณิชกานต์', 'ช่วยสุวรรณ', '108', '39746@bpk.ac.th', '123'),
(144, 67, '39747', 'ด.ญ.', 'ดากานดา', 'โรหิตเสถียร', '108', '39747@bpk.ac.th', '123'),
(145, 68, '39749', 'ด.ญ.', 'ธิดามุนี', 'ม่วงเกตุมา', '108', '39749@bpk.ac.th', '123'),
(146, 69, '39750', 'ด.ญ.', 'วริศรา', 'ผลบุญญาวัฒน์', '108', '39750@bpk.ac.th', '123'),
(147, 70, '39751', 'ด.ญ.', 'บุญญิศา', 'แซ่อุง', '108', '39751@bpk.ac.th', '123'),
(148, 71, '39752', 'ด.ญ.', 'พรณภา', 'เดชคุ้ม', '108', '39752@bpk.ac.th', '123'),
(149, 72, '39753', 'ด.ญ.', 'ภัทรภร', 'พูลสุข', '108', '39753@bpk.ac.th', '123'),
(150, 73, '39754', 'ด.ญ.', 'รินรดา', 'ศรีเมืองแพน', '108', '39754@bpk.ac.th', '123'),
(151, 74, '39755', 'ด.ญ.', 'ชญานิศ', 'สุดพิบูลย์', '108', '39755@bpk.ac.th', '123'),
(152, 75, '39756', 'ด.ญ.', 'ศศิญดา', 'เอกสันฐาน', '108', '39756@bpk.ac.th', '123');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `tb_ursername`
--
ALTER TABLE `tb_ursername`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `Code` (`Code`),
  ADD UNIQUE KEY `Email` (`Email`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `tb_ursername`
--
ALTER TABLE `tb_ursername`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=153;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
